status/2021/13aug21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>07 August 2021 - 13 August 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">07 August 2021 - 13 August 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7c07685">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org767b62e">1.1. Next step</a></li>
</ul>
</li>
<li><a href="#orgac646f0">2. Marble Computation</a>
<ul>
<li><a href="#org7dad90a">2.1. Next Steps</a>
<ul>
<li><a href="#org0d59e01">2.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org15625f1">2.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2090f17">3. MIT OCW</a>
<ul>
<li><a href="#org67e6ebc">3.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org6c42681">4. Steel Metallophone</a></li>
<li><a href="#org3b4c48d">5. Faust wasm oscillator</a></li>
<li><a href="#orga17fd3e">6. Soap Molds</a>
<ul>
<li><a href="#org5d435c1">6.1. Next steps</a>
<ul>
<li><a href="#orgb002524">6.1.1. Make sure mold doesn't leak.</a></li>
<li><a href="#orga28bc09">6.1.2. Have Annie try it out.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org49e75fe">7. Sun Ultra 10</a>
<ul>
<li><a href="#orgd219708">7.1. Next steps</a>
<ul>
<li><a href="#orgc69cac0">7.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org451a508">8. Apple iMac G4</a>
<ul>
<li><a href="#org30d6109">8.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org1071310">9. Davies Brothel</a></li>
<li><a href="#org4d19344">10. Linux Audio</a>
<ul>
<li><a href="#orge8e967c">10.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org8059f82">10.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orga9d1108">10.2. CSound programming.</a>
<ul>
<li><a href="#org18676a0">10.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org18c8c1c">10.3. Faust programming</a>
<ul>
<li><a href="#orga716dbc">10.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4406d6b">11. EPICS</a>
<ul>
<li><a href="#org92ca79a">11.1. Next steps</a>
<ul>
<li><a href="#orgee1c4ea">11.1.1. u3scpi network port testing</a></li>
<li><a href="#orgea39bcd">11.1.2. initial EPICS interface</a></li>
<li><a href="#org806ee4a">11.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org116a574">12. Brini Tracker II</a>
<ul>
<li><a href="#orgb30dbab">12.1. Next steps</a>
<ul>
<li><a href="#org375af4e">12.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org87925cd">12.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#orgf7bb333">12.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf453e1a">13. wktcolor</a>
<ul>
<li><a href="#orgba020fa">13.1. Next steps</a>
<ul>
<li><a href="#orgfdb0d32">13.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org553dc71">14. wktplot</a>
<ul>
<li><a href="#org61c2acf">14.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org9bcf92d">15. AMDGPU</a>
<ul>
<li><a href="#org5f5a9c4">15.1. Next step</a>
<ul>
<li><a href="#orgdc71b29">15.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org104b09e">16. Ninja v Make</a>
<ul>
<li><a href="#org6c6dc87">16.1. Next Step</a>
<ul>
<li><a href="#org6074a07">16.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbc65d71">17. GMP Forth</a>
<ul>
<li><a href="#org49b311b">17.1. Need to think about adding floating point support</a></li>
<li><a href="#org5a1f7a2">17.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org3e2a332">18. ca-r</a>
<ul>
<li><a href="#org6f997ae">18.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org0486476">19. Swocer</a>
<ul>
<li><a href="#org2c7745f">19.1. Most crashing addressed</a></li>
<li><a href="#org33840f8">19.2. Added outline for 'bottle' test</a></li>
<li><a href="#org7d3077e">19.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Santa Cruz Weather Station finally ready
</p>

<div id="outline-container-org7c07685" class="outline-2">
<h2 id="org7c07685"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
All Particle Monitor shelter parts fabricated.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-right">Quan.</th>
<th scope="col" class="org-left">Designed?</th>
<th scope="col" class="org-left">Fabricated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vent connector mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent connector cover</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent Standoff</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM lid</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Baffle</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Screen holder</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Inlet shroud</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount standoff</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent/UV mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">UV Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">UV/PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>
</tbody>
</table>

<p>
(1) Likely will just reuse previous assembly
</p>

<p>
Fixed crossed TX/RX in weather mast test jig.
</p>

<p>
Tested, installed, and retested assembled weather mast.
</p>

<p>
PM history graphs reinstated, but this was more fiddly than
expected - weewx software would stop after 5-10 minutes. Eventually
started working again for reasons not clear and has been stable
since Friday.
</p>

<p>
Added additional checks for pms5003 synchronization is it appeared to
have been part of the problem, now no longer clear it was.
</p>

<p>
Ensured that sczwx github repository matches what is actually running
on hardware.
</p>
</div>

<div id="outline-container-org767b62e" class="outline-3">
<h3 id="org767b62e"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
<p>
None!
</p>
</div>
</div>
</div>
<div id="outline-container-orgac646f0" class="outline-2">
<h2 id="orgac646f0"><span class="section-number-2">2.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-2">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org7dad90a" class="outline-3">
<h3 id="org7dad90a"><span class="section-number-3">2.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org0d59e01" class="outline-4">
<h4 id="org0d59e01"><span class="section-number-4">2.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org15625f1" class="outline-4">
<h4 id="org15625f1"><span class="section-number-4">2.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. I think little "kickers" on the side should
be sufficient for a purely mechanical approach.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2090f17" class="outline-2">
<h2 id="org2090f17"><span class="section-number-2">3.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-3">
<p>
Preparation to start MIT Open CourseWare classes 18.01 (Single
Variable Calculus) and 8.01 (Physics I - Classical Mechanics).
</p>
</div>

<div id="outline-container-org67e6ebc" class="outline-3">
<h3 id="org67e6ebc"><span class="section-number-3">3.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Start studying!
</p>
</div>
</div>
</div>
<div id="outline-container-org6c42681" class="outline-2">
<h2 id="org6c42681"><span class="section-number-2">4.</span> Steel Metallophone</h2>
<div class="outline-text-2" id="text-4">
<p>
Did some analysis on using 6 and 12 inch steel pipe for metallophone
and chime construction (for Kevin).
</p>
</div>
</div>
<div id="outline-container-org3b4c48d" class="outline-2">
<h2 id="org3b4c48d"><span class="section-number-2">5.</span> Faust wasm oscillator</h2>
<div class="outline-text-2" id="text-5">
<p>
Built a simple web browser oscillator using Faust/WASM.
</p>
</div>
</div>
<div id="outline-container-orga17fd3e" class="outline-2">
<h2 id="orga17fd3e"><span class="section-number-2">6.</span> Soap Molds</h2>
<div class="outline-text-2" id="text-6">
<p>
Printed a shallower top. Still not quite right, but workable.
</p>
</div>
<div id="outline-container-org5d435c1" class="outline-3">
<h3 id="org5d435c1"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgb002524" class="outline-4">
<h4 id="orgb002524"><span class="section-number-4">6.1.1.</span> Make sure mold doesn't leak.</h4>
</div>
<div id="outline-container-orga28bc09" class="outline-4">
<h4 id="orga28bc09"><span class="section-number-4">6.1.2.</span> Have Annie try it out.</h4>
</div>
</div>
</div>
<div id="outline-container-org49e75fe" class="outline-2">
<h2 id="org49e75fe"><span class="section-number-2">7.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-7">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgd219708" class="outline-3">
<h3 id="orgd219708"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgc69cac0" class="outline-4">
<h4 id="orgc69cac0"><span class="section-number-4">7.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org451a508" class="outline-2">
<h2 id="org451a508"><span class="section-number-2">8.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-8">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org30d6109" class="outline-3">
<h3 id="org30d6109"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org1071310" class="outline-2">
<h2 id="org1071310"><span class="section-number-2">9.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-9">
<p>
Next hearing: 02 September; Department 37
</p>
</div>
</div>
<div id="outline-container-org4d19344" class="outline-2">
<h2 id="org4d19344"><span class="section-number-2">10.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orge8e967c" class="outline-3">
<h3 id="orge8e967c"><span class="section-number-3">10.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org8059f82" class="outline-4">
<h4 id="org8059f82"><span class="section-number-4">10.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orga9d1108" class="outline-3">
<h3 id="orga9d1108"><span class="section-number-3">10.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-10-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org18676a0" class="outline-4">
<h4 id="org18676a0"><span class="section-number-4">10.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-10-2-1">
</div>
<ol class="org-ol">
<li><a id="orgfcb91d9"></a>loscil demo<br /></li>
<li><a id="org63b275a"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org18c8c1c" class="outline-3">
<h3 id="org18c8c1c"><span class="section-number-3">10.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-10-3">
</div>
<div id="outline-container-orga716dbc" class="outline-4">
<h4 id="orga716dbc"><span class="section-number-4">10.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-10-3-1">
</div>
<ol class="org-ol">
<li><a id="org515c613"></a>GAC Patch save/restore<br /></li>
<li><a id="orge25aacb"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-10-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="orge10b681"></a>OSC control surface<br />
<div class="outline-text-5" id="text-10-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org0fedd52"></a>Faust/csound<br />
<div class="outline-text-5" id="text-10-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4406d6b" class="outline-2">
<h2 id="org4406d6b"><span class="section-number-2">11.</span> EPICS</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org92ca79a" class="outline-3">
<h3 id="org92ca79a"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orgee1c4ea" class="outline-4">
<h4 id="orgee1c4ea"><span class="section-number-4">11.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orgea39bcd" class="outline-4">
<h4 id="orgea39bcd"><span class="section-number-4">11.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org806ee4a" class="outline-4">
<h4 id="org806ee4a"><span class="section-number-4">11.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org116a574" class="outline-2">
<h2 id="org116a574"><span class="section-number-2">12.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-12">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-orgb30dbab" class="outline-3">
<h3 id="orgb30dbab"><span class="section-number-3">12.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-org375af4e" class="outline-4">
<h4 id="org375af4e"><span class="section-number-4">12.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org87925cd" class="outline-4">
<h4 id="org87925cd"><span class="section-number-4">12.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-orgf7bb333" class="outline-4">
<h4 id="orgf7bb333"><span class="section-number-4">12.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgf453e1a" class="outline-2">
<h2 id="orgf453e1a"><span class="section-number-2">13.</span> wktcolor</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgba020fa" class="outline-3">
<h3 id="orgba020fa"><span class="section-number-3">13.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgfdb0d32" class="outline-4">
<h4 id="orgfdb0d32"><span class="section-number-4">13.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org553dc71" class="outline-2">
<h2 id="org553dc71"><span class="section-number-2">14.</span> wktplot</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org61c2acf" class="outline-3">
<h3 id="org61c2acf"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org9bcf92d" class="outline-2">
<h2 id="org9bcf92d"><span class="section-number-2">15.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org5f5a9c4" class="outline-3">
<h3 id="org5f5a9c4"><span class="section-number-3">15.1.</span> Next step</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-orgdc71b29" class="outline-4">
<h4 id="orgdc71b29"><span class="section-number-4">15.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org104b09e" class="outline-2">
<h2 id="org104b09e"><span class="section-number-2">16.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org6c6dc87" class="outline-3">
<h3 id="org6c6dc87"><span class="section-number-3">16.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org6074a07" class="outline-4">
<h4 id="org6074a07"><span class="section-number-4">16.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orgbc65d71" class="outline-2">
<h2 id="orgbc65d71"><span class="section-number-2">17.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org49b311b" class="outline-3">
<h3 id="org49b311b"><span class="section-number-3">17.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org5a1f7a2" class="outline-3">
<h3 id="org5a1f7a2"><span class="section-number-3">17.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org3e2a332" class="outline-2">
<h2 id="org3e2a332"><span class="section-number-2">18.</span> ca-r</h2>
<div class="outline-text-2" id="text-18">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org6f997ae" class="outline-3">
<h3 id="org6f997ae"><span class="section-number-3">18.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-18-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-org0486476" class="outline-2">
<h2 id="org0486476"><span class="section-number-2">19.</span> Swocer</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org2c7745f" class="outline-3">
<h3 id="org2c7745f"><span class="section-number-3">19.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org33840f8" class="outline-3">
<h3 id="org33840f8"><span class="section-number-3">19.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-19-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-org7d3077e" class="outline-3">
<h3 id="org7d3077e"><span class="section-number-3">19.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-19-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>